testdata/IN_2023_02/Roundtrip/produkt/arbeitskraft/buz/20160212_buz_ueberschuss_wiehv_2023_02b.xml_request_2023_02b.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Body>
    <tarif:getOrder xmlns:allg="http://www.bipro.net/namespace/allgemein" xmlns:basis="http://www.bipro.net/namespace/basis" xmlns:dt="http://www.bipro.net/namespace/datentypen" xmlns:fragen="http://www.bipro.net/namespace/fragen" xmlns:gevo="http://www.bipro.net/namespace/gevo" xmlns:kapanl-basis="http://www.bipro.net/namespace/kapitalanlage/basis" xmlns:nachr="http://www.bipro.net/namespace/nachrichten" xmlns:partner="http://www.bipro.net/namespace/partner" xmlns:pm="http://www.bipro.net/namespace/produktmodell" xmlns:pm-leben="http://www.bipro.net/namespace/versicherung/produktmodell/leben" xmlns:tarif="http://www.bipro.net/namespace/versicherung/tarifierung" xmlns:vbl="urn:de:vb:bipro:taa:leben:1.12" xmlns:vs-pm="http://www.bipro.net/namespace/versicherung/produktmodell" xmlns:xmime="http://www.w3.org/2005/05/xmlmime" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
        
      <tarif:Request>
            
        <nachr:BiPROVersion>2.4.6.1.12</nachr:BiPROVersion>
        <nachr:ConsumerID>WS DEV TEAM</nachr:ConsumerID>
            
        <tarif:Antrag>
                
          <gevo:Vermittler>
                    
            <allg:Vermittlernummer>123/456</allg:Vermittlernummer>
                    
            <allg:PartnerID>1</allg:PartnerID>
                    
            <allg:Vermittlerrolle>
                        
              <allg:ArtID>01</allg:ArtID>
                        
              <allg:Vermittlertyp>01</allg:Vermittlertyp>
                      
            </allg:Vermittlerrolle>
                  
          </gevo:Vermittler>
                
          <gevo:Vermittler>
                    
            <allg:Vermittlernummer>789/963</allg:Vermittlernummer>
                    
            <allg:PartnerID>1</allg:PartnerID>
                    
            <allg:Vermittlerrolle>
                        
              <allg:ArtID>10</allg:ArtID>
                        
              <allg:Vermittlertyp>02</allg:Vermittlertyp>
                      
            </allg:Vermittlerrolle>
                  
          </gevo:Vermittler>
                
          <tarif:Partner xsi:type="partner:CT_JuristischePerson">
                    
            <partner:Name>Kasparbauer Claudia</partner:Name>
                    
            <partner:PartnerID>1</partner:PartnerID>
                    
            <partner:Anschrift>
                        
              <allg:Strasse>Kneippstr.</allg:Strasse>
                        
              <allg:Hausnummer>7</allg:Hausnummer>
                        
              <allg:Postleitzahl>94577</allg:Postleitzahl>
                        
              <allg:Ort>Winzer</allg:Ort>
                      
            </partner:Anschrift>
                    
            <partner:Kommunikationsverbindung>
                        
              <partner:ArtID>20</partner:ArtID>
                        
              <partner:Kommunikationsadresse>08545/9699-60</partner:Kommunikationsadresse>
                      
            </partner:Kommunikationsverbindung>
                    
            <partner:Kommunikationsverbindung>
                        
              <partner:ArtID>40</partner:ArtID>
                        
              <partner:Kommunikationsadresse>08545/9699-69</partner:Kommunikationsadresse>
                      
            </partner:Kommunikationsverbindung>
                    
            <partner:Kommunikationsverbindung>
                        
              <partner:ArtID>50</partner:ArtID>
                        
              <partner:Kommunikationsadresse>ck@maklersoftware.com</partner:Kommunikationsadresse>
                      
            </partner:Kommunikationsverbindung>
                  
          </tarif:Partner>
                
          <tarif:Partner xsi:type="partner:CT_Person">
                    
            <partner:Anrede>1</partner:Anrede>
                    
            <partner:Name>Meier</partner:Name>
                    
            <partner:PartnerID>3</partner:PartnerID>
                    
            <partner:Anschrift>
                        
              <allg:Strasse>Ahornstr.</allg:Strasse>
                        
              <allg:Hausnummer>3</allg:Hausnummer>
                        
              <allg:Postleitzahl>94550</allg:Postleitzahl>
                        
              <allg:Ort>Künzing</allg:Ort>
                        
              <partner:ArtID>1</partner:ArtID>
                      
            </partner:Anschrift>
                    
            <partner:Bankverbindung>
                        
              <partner:Institut>Sparkasse Regen-Viechtach</partner:Institut>
                        
              <partner:IBAN>DE46741514500023021900</partner:IBAN>
                        
              <partner:BIC>BYLADEM1REG</partner:BIC>
                        
              <partner:Einzugsermaechtigung>true</partner:Einzugsermaechtigung>
                      
            </partner:Bankverbindung>
                    
            <partner:Vorname>Sonja</partner:Vorname>
                    
            <partner:Geburtsdatum>1992-11-01</partner:Geburtsdatum>
                    
            <partner:Geschlecht>1</partner:Geschlecht>
                    
            <partner:Titel>
        </partner:Titel>
                    
            <partner:Geburtsort>
        </partner:Geburtsort>
                    
            <partner:Staatsangehoerigkeit>D</partner:Staatsangehoerigkeit>
                    
            <partner:Berufstaetigkeit>
                        
              <basis:Erweiterung xsi:type="vbl:CT_BerufstaetigkeitErweiterung">
                            
                <vbl:Personalverantwortung>false</vbl:Personalverantwortung>
                          
              </basis:Erweiterung>
                        
              <partner:Beruf>Büroangestellte,r</partner:Beruf>
                        
              <partner:StellungImBeruf xsi:type="dt:STE_StellungImBerufBasis">01</partner:StellungImBeruf>
                        
              <partner:KoerperlichTaetig>5</partner:KoerperlichTaetig>
                        
              <partner:NichtKoerperlichTaetig>80</partner:NichtKoerperlichTaetig>
                      
            </partner:Berufstaetigkeit>
                    
            <partner:Ausbildung>
                        
              <partner:ArtID xsi:type="dt:STE_AusbildungsartBasis">BeruflicheAusbildung</partner:ArtID>
                      
            </partner:Ausbildung>
                  
          </tarif:Partner>
                
          <tarif:Versicherungsnehmer>
                    
            <partner:PartnerID>3</partner:PartnerID>
                  
          </tarif:Versicherungsnehmer>
                
          <tarif:Verkaufsprodukt>
                    
            <pm:Produkt xsi:type="pm-leben:CT_Produkt">
                        
              <basis:Erweiterung xsi:type="vbl:CT_ProduktErweiterung">
                            
                <vbl:Tarifgruppe>Normal</vbl:Tarifgruppe>
                          
              </basis:Erweiterung>
                        
              <pm:GewuenschteZahlungsweise>8</pm:GewuenschteZahlungsweise>
                        
              <pm:Beitrag>
                            
                <pm:ArtID xsi:type="dt:STE_BeitragBasis">01</pm:ArtID>
                            
                <pm:Betrag>
                                
                  <allg:Betrag>200.00</allg:Betrag>
                                
                  <allg:Waehrung>EUR</allg:Waehrung>
                              
                </pm:Betrag>
                            
                <pm:Zahlungsweise>8</pm:Zahlungsweise>
                          
              </pm:Beitrag>
                        
              <pm:Versicherungsdauer>
                            
                <allg:Beginn>2023-03-01T12:00</allg:Beginn>
                          
              </pm:Versicherungsdauer>
                        
              <pm:Kennung>BIR</pm:Kennung>
                        
              <pm:Elementarprodukt xsi:type="pm-leben:CT_Rente">
                            
                <basis:Erweiterung xsi:type="vbl:CT_RenteErweiterung">
                                
                  <vbl:TodesfallleistungImBezug>IndividuelleGarantiezeit</vbl:TodesfallleistungImBezug>
                                
                  <vbl:FondsrenteDaten>
                                    
                    <vbl:ErhoehterTodesfallschutz>false</vbl:ErhoehterTodesfallschutz>
                                  
                  </vbl:FondsrenteDaten>
                                
                  <vbl:BasisrenteDaten>
                                    
                    <vbl:VorgabeartTodesfallsumme>AlsRente</vbl:VorgabeartTodesfallsumme>
                                  
                  </vbl:BasisrenteDaten>
                                
                  <vbl:IndexDaten>
                                    
                    <vbl:VorgabeartIndexbeteiligung>Chance</vbl:VorgabeartIndexbeteiligung>
                                  
                  </vbl:IndexDaten>
                              
                </basis:Erweiterung>
                            
                <pm:Versicherungsdauer>
                                
                  <allg:AnzahlJahre>35</allg:AnzahlJahre>
                              
                </pm:Versicherungsdauer>
                            
                <vs-pm:VersicherungssummeOderLeistung>
                                
                  <vs-pm:ArtID xsi:type="dt:STE_VersicherungssummeOderLeistungBasis">GarantierteRente</vs-pm:ArtID>
                                
                  <vs-pm:Wertschluessel xsi:type="vbl:STE_LeistungSchluesselErweitert">Klassisch</vs-pm:Wertschluessel>
                                
                  <vs-pm:Werteinheit>20</vs-pm:Werteinheit>
                                
                  <vs-pm:Waehrung>EUR</vs-pm:Waehrung>
                                
                  <vs-pm:Auszahlungsweise>8</vs-pm:Auszahlungsweise>
                              
                </vs-pm:VersicherungssummeOderLeistung>
                            
                <pm-leben:Hochrechnungszins>5</pm-leben:Hochrechnungszins>
                            
                <pm-leben:IstHauptversicherung>true</pm-leben:IstHauptversicherung>
                            
                <pm-leben:UeberschussverwendungNachLeistung xsi:type="dt:STE_UeberschussverwendungBasis">15</pm-leben:UeberschussverwendungNachLeistung>
                            
                <pm-leben:VersichertePerson>
                                
                  <partner:PartnerID>3</partner:PartnerID>
                              
                </pm-leben:VersichertePerson>
                            
                <pm-leben:BeitragsRueckgewaehrBeiTod>01</pm-leben:BeitragsRueckgewaehrBeiTod>
                            
                <pm-leben:Garantiezeit>
                                
                  <allg:AnzahlJahre>15</allg:AnzahlJahre>
                                
                  <allg:AnzahlMonate>0</allg:AnzahlMonate>
                              
                </pm-leben:Garantiezeit>
                          
              </pm:Elementarprodukt>
                        
              <pm:Elementarprodukt xsi:type="pm-leben:CT_ArbeitskraftAbsicherung">
                            
                <basis:Erweiterung xsi:type="vbl:CT_ArbeitskraftAbsicherungErweiterung">
                                
                  <vbl:DynamisierungDerHauptversicherungImLeistungsfall>0</vbl:DynamisierungDerHauptversicherungImLeistungsfall>
                              
                </basis:Erweiterung>
                            
                <pm:Versicherungsdauer>
                                
                  <allg:AnzahlJahre>35</allg:AnzahlJahre>
                              
                </pm:Versicherungsdauer>
                            
                <vs-pm:VersicherungssummeOderLeistung>
                                
                  <vs-pm:ArtID xsi:type="dt:STE_VersicherungssummeOderLeistungBasis">GarantierteRente</vs-pm:ArtID>
                                
                  <vs-pm:Wert>1000.00</vs-pm:Wert>
                                
                  <vs-pm:Werteinheit>20</vs-pm:Werteinheit>
                                
                  <vs-pm:Waehrung>EUR</vs-pm:Waehrung>
                                
                  <vs-pm:Auszahlungsweise>8</vs-pm:Auszahlungsweise>
                              
                </vs-pm:VersicherungssummeOderLeistung>
                            
                <pm-leben:IstHauptversicherung>false</pm-leben:IstHauptversicherung>
                            
                <pm-leben:UeberschussverwendungVorLeistung xsi:type="vbl:STE_UeberschussverwendungErweitert">WieHauptversicherung</pm-leben:UeberschussverwendungVorLeistung>
                            
                <pm-leben:VersichertePerson>
                                
                  <partner:PartnerID>3</partner:PartnerID>
                              
                </pm-leben:VersichertePerson>
                            
                <pm-leben:Art xsi:type="dt:STE_UnfaehigkeitsZusatzArtBasis">Rente</pm-leben:Art>
                            
                <pm-leben:Auspraegung xsi:type="dt:STE_UnfaehigkeitsZusatzAuspraegungBasis">BU</pm-leben:Auspraegung>
                          
              </pm:Elementarprodukt>
                        
              <pm-leben:VorgabeBerechnung>
                            
                <pm-leben:ArtID xsi:type="dt:STE_VorgabeBerechnungBasis">Bruttobeitrag</pm-leben:ArtID>
                            
                <pm-leben:Kontext xsi:type="dt:STE_VorgabeBerechnungKontextBasis">Produkt</pm-leben:Kontext>
                          
              </pm-leben:VorgabeBerechnung>
                      
            </pm:Produkt>
                  
          </tarif:Verkaufsprodukt>
                
          <tarif:Unterschriftsverfahren>03</tarif:Unterschriftsverfahren>
                
          <tarif:Antragsart>01</tarif:Antragsart>
                
          <tarif:Beitragszahler>
                    
            <partner:PartnerID>3</partner:PartnerID>
                  
          </tarif:Beitragszahler>
              
        </tarif:Antrag>
          
      </tarif:Request>
      
    </tarif:getOrder>
  </soapenv:Body>
</soapenv:Envelope>
